// layouts.js
export const layouts = [
  {
    id: 'section_1',
    items: [
      {
        type: '_h3',
        row: { start: 3, end: 17 },
        col: { start: 17, end: 19 },
        animSpanSettings: {
            text: '当环境最昏暗时，火焰燃烧的光芒才最夺目',
            autoStart: false,
            TextLib: '繁星的海洋里，飞机缓缓地滑翔，你像猫咪一样，悄然无息的靠近，从我无法顾及的角度，拨弄我心弦，惊讶之情，无以言表。你让我总是跟不上你的步伐，钢铁般的躯体，仿佛流星一样，只是与你仰望同一片天空，眼里见惯的风景便变的不一样了。你的一举一动牵动我的一喜一忧，在心中化为点点音符，这份感觉该怎么称呼才好，这种心情该如何表达才行，这也许就是所谓的恋爱吧',
            rangeLen: 4,
            classname: 'animspan'
        }
      },
      {
        type: '_h4',
        row: { start: 2, end: 11 },
        col: { start: 15, end: 16 },
        animSpanSettings: {
            autoStart: false,
            TextLib: '繁星的海洋里，飞机缓缓地滑翔，你像猫咪一样，悄然无息的靠近，从我无法顾及的角度，拨弄我心弦，惊讶之情，无以言表。你让我总是跟不上你的步伐，钢铁般的躯体，仿佛流星一样，只是与你仰望同一片天空，眼里见惯的风景便变的不一样了。你的一举一动牵动我的一喜一忧，在心中化为点点音符，这份感觉该怎么称呼才好，这种心情该如何表达才行，这也许就是所谓的恋爱吧',
            rangeLen: 4,
            classname: 'animspan',
            text: '正因为没有翅膀，人们才会寻找飞翔的方法'
        }
      },
      {
        type: '_h4',
        row: { start: 5, end: 14 },
        col: { start: 13, end: 14 },
        animSpanSettings: {
            autoStart: false,
            TextLib: '繁星的海洋里，飞机缓缓地滑翔，你像猫咪一样，悄然无息的靠近，从我无法顾及的角度，拨弄我心弦，惊讶之情，无以言表。你让我总是跟不上你的步伐，钢铁般的躯体，仿佛流星一样，只是与你仰望同一片天空，眼里见惯的风景便变的不一样了。你的一举一动牵动我的一喜一忧，在心中化为点点音符，这份感觉该怎么称呼才好，这种心情该如何表达才行，这也许就是所谓的恋爱吧',
            rangeLen: 4,
            classname: 'animspan',
            text: '学会承受，学会长大，学会哭过以后，还能微笑地拥抱爸爸妈妈'
        }
      },
      {
        type: '_h4',
        row: { start: 4, end: 17 },
        col: { start: 11, end: 12 },
        animSpanSettings: {
            autoStart: false,
            TextLib: '繁星的海洋里，飞机缓缓地滑翔，你像猫咪一样，悄然无息的靠近，从我无法顾及的角度，拨弄我心弦，惊讶之情，无以言表。你让我总是跟不上你的步伐，钢铁般的躯体，仿佛流星一样，只是与你仰望同一片天空，眼里见惯的风景便变的不一样了。你的一举一动牵动我的一喜一忧，在心中化为点点音符，这份感觉该怎么称呼才好，这种心情该如何表达才行，这也许就是所谓的恋爱吧',
            rangeLen: 4,
            classname: 'animspan',
            text: '温柔地对待这个世界，也温柔地对待自己，不慌不忙，慢慢成长'
        }
      },
      {
        type: '_h4',
        row: { start: 2, end: 11 },
        col: { start: 9, end: 10 },
        animSpanSettings: {
            autoStart: false,
            TextLib: '繁星的海洋里，飞机缓缓地滑翔，你像猫咪一样，悄然无息的靠近，从我无法顾及的角度，拨弄我心弦，惊讶之情，无以言表。你让我总是跟不上你的步伐，钢铁般的躯体，仿佛流星一样，只是与你仰望同一片天空，眼里见惯的风景便变的不一样了。你的一举一动牵动我的一喜一忧，在心中化为点点音符，这份感觉该怎么称呼才好，这种心情该如何表达才行，这也许就是所谓的恋爱吧',
            rangeLen: 4,
            classname: 'animspan',
            text: '如果曾经有一个人为了你而等待，不管是三年还是三个月，请不要轻率地选择拒绝'

        }
      },
      {
        type: '_h4',
        row: { start: 7, end: 17 },
        col: { start: 7, end: 8 },
        animSpanSettings: {
            autoStart: false,
            TextLib: '繁星的海洋里，飞机缓缓地滑翔，你像猫咪一样，悄然无息的靠近，从我无法顾及的角度，拨弄我心弦，惊讶之情，无以言表。你让我总是跟不上你的步伐，钢铁般的躯体，仿佛流星一样，只是与你仰望同一片天空，眼里见惯的风景便变的不一样了。你的一举一动牵动我的一喜一忧，在心中化为点点音符，这份感觉该怎么称呼才好，这种心情该如何表达才行，这也许就是所谓的恋爱吧',
            rangeLen: 4,
            classname: 'animspan',
            text: '我们总是在意自己错过太多，却不曾注意自己拥有多少'
        }
      },
      {
        type: '_h4',
        row: { start: 4, end: 15 },
        col: { start: 4, end: 5 },
        animSpanSettings: {
            autoStart: false,
            TextLib: '繁星的海洋里，飞机缓缓地滑翔，你像猫咪一样，悄然无息的靠近，从我无法顾及的角度，拨弄我心弦，惊讶之情，无以言表。你让我总是跟不上你的步伐，钢铁般的躯体，仿佛流星一样，只是与你仰望同一片天空，眼里见惯的风景便变的不一样了。你的一举一动牵动我的一喜一忧，在心中化为点点音符，这份感觉该怎么称呼才好，这种心情该如何表达才行，这也许就是所谓的恋爱吧',
            rangeLen: 4,
            classname: 'animspan',
            text: '多年以后，当我又开始回忆那些失去的人或事时，我一定会豁达地抿着嘴微笑'
        }
      },
      {
        type: '_h4',
        row: { start: 13, end: 19 },
        col: { start: 1, end: 2 },
          animSpanSettings: {
            
            autoStart: false,
            TextLib: '繁星的海洋里，飞机缓缓地滑翔，你像猫咪一样，悄然无息的靠近，从我无法顾及的角度，拨弄我心弦，惊讶之情，无以言表。你让我总是跟不上你的步伐，钢铁般的躯体，仿佛流星一样，只是与你仰望同一片天空，眼里见惯的风景便变的不一样了。你的一举一动牵动我的一喜一忧，在心中化为点点音符，这份感觉该怎么称呼才好，这种心情该如何表达才行，这也许就是所谓的恋爱吧',
            rangeLen: 4,
            classname: 'animspan',
            text: '没有期待就没有失望，没有羁绊就不会受伤'
        }
      }
    ]
  }

];